app/controllers/articles_controller.rb

  def index
  	@articles = Article.all
  	@categories = Category.all
---
SELECT "articles".* FROM "articles"
SELECT "categories".* FROM "categories"

  def create
  	Article.create title: params[:title], category_id: params[:category_id]
---
INSERT INTO "articles" ("title", "category_id") VALUES (?, ?)  [["title", "Hello my Name is Joe"], ["category_id", 1]]

  def update
  Article.find(params[:id]).update title: params[:title], content: params[:content]
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "content" = ? WHERE "articles"."id" = ?  [["title", "I like big buts"], ["content", "ass ass ass ass ass"], ["id", 23]]

  def destroy
    Article.find(params[:id]).destroy
---
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 22]]
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]

  def comment
    @comment = Comment.create content: params[:content], author: params[:author], article_id: params[:id]
---
INSERT INTO "comments" ("author", "content", "article_id") VALUES (?, ?, ?)  [["author", "db"], ["content", "hohoho"], ["article_id", 2]]